InformationRegisters/ДатаЗапретаРедактирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ДатаЗапретаРедактирования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗапрета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Право</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/Системный/Ext/Module.bsl
Процедура ДатаЗапретаРедактированияПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	// Вставити вміст обробника.
	
	Запрос =  Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДатаЗапретаРедактирования.Право КАК Право,
	               |	ДатаЗапретаРедактирования.ДатаЗапрета КАК ДатаЗапрета
	               |ИЗ
	               |	РегистрСведений.ДатаЗапретаРедактирования КАК ДатаЗапретаРедактирования
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаЗапрета";
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Для каждого стр из ТЗ цикл
		Если РольДоступна(стр.Право) тогда
			Если Источник.Дата < стр.ДатаЗапрета тогда
				Сообщить("ПЛОХАЯ ДАТА!");
				Отказ = Истина;
				Возврат;
			Иначе
				Сообщить("Дата редактирования - разрешено!");
				Прервать;
			КонецЕсли;
			
		конецесли;
	Конеццикла;
	
		
	
КонецПроцедуры
